{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_15", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "char_input"}, "name": "char_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "token_inputs"}, "name": "token_inputs", "inbound_nodes": []}, {"class_name": "TextVectorization", "config": {"name": "text_vectorization_1", "trainable": true, "batch_input_shape": [null], "dtype": "string", "max_tokens": 70, "standardize": "lower_and_strip_punctuation", "split": "whitespace", "ngrams": null, "output_mode": "int", "output_sequence_length": 290, "pad_to_max_tokens": false}, "name": "text_vectorization_1", "inbound_nodes": [[["char_input", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/google/universal-sentence-encoder/4"}, "name": "keras_layer", "inbound_nodes": [[["token_inputs", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 28, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding", "inbound_nodes": [[["text_vectorization_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["keras_layer", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 24, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_2", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "token_char_hybrid", "trainable": true, "dtype": "float32", "axis": -1}, "name": "token_char_hybrid", "inbound_nodes": [[["dense_12", 0, 0, {}], ["bidirectional_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["token_char_hybrid", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "line_number_input"}, "name": "line_number_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "total_line_input"}, "name": "total_line_input", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["line_number_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["total_line_input", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "tribrid_emb", "trainable": true, "dtype": "float32", "axis": -1}, "name": "tribrid_emb", "inbound_nodes": [[["dropout_4", 0, 0, {}], ["dense_14", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["tribrid_emb", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_layer", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}], "input_layers": [["token_inputs", 0, 0], ["char_input", 0, 0], ["line_number_input", 0, 0], ["total_line_input", 0, 0]], "output_layers": [["output_layer", 0, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.2, "axis": -1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of246.bin", "group1-shard2of246.bin", "group1-shard3of246.bin", "group1-shard4of246.bin", "group1-shard5of246.bin", "group1-shard6of246.bin", "group1-shard7of246.bin", "group1-shard8of246.bin", "group1-shard9of246.bin", "group1-shard10of246.bin", "group1-shard11of246.bin", "group1-shard12of246.bin", "group1-shard13of246.bin", "group1-shard14of246.bin", "group1-shard15of246.bin", "group1-shard16of246.bin", "group1-shard17of246.bin", "group1-shard18of246.bin", "group1-shard19of246.bin", "group1-shard20of246.bin", "group1-shard21of246.bin", "group1-shard22of246.bin", "group1-shard23of246.bin", "group1-shard24of246.bin", "group1-shard25of246.bin", "group1-shard26of246.bin", "group1-shard27of246.bin", "group1-shard28of246.bin", "group1-shard29of246.bin", "group1-shard30of246.bin", "group1-shard31of246.bin", "group1-shard32of246.bin", "group1-shard33of246.bin", "group1-shard34of246.bin", "group1-shard35of246.bin", "group1-shard36of246.bin", "group1-shard37of246.bin", "group1-shard38of246.bin", "group1-shard39of246.bin", "group1-shard40of246.bin", "group1-shard41of246.bin", "group1-shard42of246.bin", "group1-shard43of246.bin", "group1-shard44of246.bin", "group1-shard45of246.bin", "group1-shard46of246.bin", "group1-shard47of246.bin", "group1-shard48of246.bin", "group1-shard49of246.bin", "group1-shard50of246.bin", "group1-shard51of246.bin", "group1-shard52of246.bin", "group1-shard53of246.bin", "group1-shard54of246.bin", "group1-shard55of246.bin", "group1-shard56of246.bin", "group1-shard57of246.bin", "group1-shard58of246.bin", "group1-shard59of246.bin", "group1-shard60of246.bin", "group1-shard61of246.bin", "group1-shard62of246.bin", "group1-shard63of246.bin", "group1-shard64of246.bin", "group1-shard65of246.bin", "group1-shard66of246.bin", "group1-shard67of246.bin", "group1-shard68of246.bin", "group1-shard69of246.bin", "group1-shard70of246.bin", "group1-shard71of246.bin", "group1-shard72of246.bin", "group1-shard73of246.bin", "group1-shard74of246.bin", "group1-shard75of246.bin", "group1-shard76of246.bin", "group1-shard77of246.bin", "group1-shard78of246.bin", "group1-shard79of246.bin", "group1-shard80of246.bin", "group1-shard81of246.bin", "group1-shard82of246.bin", "group1-shard83of246.bin", "group1-shard84of246.bin", "group1-shard85of246.bin", "group1-shard86of246.bin", "group1-shard87of246.bin", "group1-shard88of246.bin", "group1-shard89of246.bin", "group1-shard90of246.bin", "group1-shard91of246.bin", "group1-shard92of246.bin", "group1-shard93of246.bin", "group1-shard94of246.bin", "group1-shard95of246.bin", "group1-shard96of246.bin", "group1-shard97of246.bin", "group1-shard98of246.bin", "group1-shard99of246.bin", "group1-shard100of246.bin", "group1-shard101of246.bin", "group1-shard102of246.bin", "group1-shard103of246.bin", "group1-shard104of246.bin", "group1-shard105of246.bin", "group1-shard106of246.bin", "group1-shard107of246.bin", "group1-shard108of246.bin", "group1-shard109of246.bin", "group1-shard110of246.bin", "group1-shard111of246.bin", "group1-shard112of246.bin", "group1-shard113of246.bin", "group1-shard114of246.bin", "group1-shard115of246.bin", "group1-shard116of246.bin", "group1-shard117of246.bin", "group1-shard118of246.bin", "group1-shard119of246.bin", "group1-shard120of246.bin", "group1-shard121of246.bin", "group1-shard122of246.bin", "group1-shard123of246.bin", "group1-shard124of246.bin", "group1-shard125of246.bin", "group1-shard126of246.bin", "group1-shard127of246.bin", "group1-shard128of246.bin", "group1-shard129of246.bin", "group1-shard130of246.bin", "group1-shard131of246.bin", "group1-shard132of246.bin", "group1-shard133of246.bin", "group1-shard134of246.bin", "group1-shard135of246.bin", "group1-shard136of246.bin", "group1-shard137of246.bin", "group1-shard138of246.bin", "group1-shard139of246.bin", "group1-shard140of246.bin", "group1-shard141of246.bin", "group1-shard142of246.bin", "group1-shard143of246.bin", "group1-shard144of246.bin", "group1-shard145of246.bin", "group1-shard146of246.bin", "group1-shard147of246.bin", "group1-shard148of246.bin", "group1-shard149of246.bin", "group1-shard150of246.bin", "group1-shard151of246.bin", "group1-shard152of246.bin", "group1-shard153of246.bin", "group1-shard154of246.bin", "group1-shard155of246.bin", "group1-shard156of246.bin", "group1-shard157of246.bin", "group1-shard158of246.bin", "group1-shard159of246.bin", "group1-shard160of246.bin", "group1-shard161of246.bin", "group1-shard162of246.bin", "group1-shard163of246.bin", "group1-shard164of246.bin", "group1-shard165of246.bin", "group1-shard166of246.bin", "group1-shard167of246.bin", "group1-shard168of246.bin", "group1-shard169of246.bin", "group1-shard170of246.bin", "group1-shard171of246.bin", "group1-shard172of246.bin", "group1-shard173of246.bin", "group1-shard174of246.bin", "group1-shard175of246.bin", "group1-shard176of246.bin", "group1-shard177of246.bin", "group1-shard178of246.bin", "group1-shard179of246.bin", "group1-shard180of246.bin", "group1-shard181of246.bin", "group1-shard182of246.bin", "group1-shard183of246.bin", "group1-shard184of246.bin", "group1-shard185of246.bin", "group1-shard186of246.bin", "group1-shard187of246.bin", "group1-shard188of246.bin", "group1-shard189of246.bin", "group1-shard190of246.bin", "group1-shard191of246.bin", "group1-shard192of246.bin", "group1-shard193of246.bin", "group1-shard194of246.bin", "group1-shard195of246.bin", "group1-shard196of246.bin", "group1-shard197of246.bin", "group1-shard198of246.bin", "group1-shard199of246.bin", "group1-shard200of246.bin", "group1-shard201of246.bin", "group1-shard202of246.bin", "group1-shard203of246.bin", "group1-shard204of246.bin", "group1-shard205of246.bin", "group1-shard206of246.bin", "group1-shard207of246.bin", "group1-shard208of246.bin", "group1-shard209of246.bin", "group1-shard210of246.bin", "group1-shard211of246.bin", "group1-shard212of246.bin", "group1-shard213of246.bin", "group1-shard214of246.bin", "group1-shard215of246.bin", "group1-shard216of246.bin", "group1-shard217of246.bin", "group1-shard218of246.bin", "group1-shard219of246.bin", "group1-shard220of246.bin", "group1-shard221of246.bin", "group1-shard222of246.bin", "group1-shard223of246.bin", "group1-shard224of246.bin", "group1-shard225of246.bin", "group1-shard226of246.bin", "group1-shard227of246.bin", "group1-shard228of246.bin", "group1-shard229of246.bin", "group1-shard230of246.bin", "group1-shard231of246.bin", "group1-shard232of246.bin", "group1-shard233of246.bin", "group1-shard234of246.bin", "group1-shard235of246.bin", "group1-shard236of246.bin", "group1-shard237of246.bin", "group1-shard238of246.bin", "group1-shard239of246.bin", "group1-shard240of246.bin", "group1-shard241of246.bin", "group1-shard242of246.bin", "group1-shard243of246.bin", "group1-shard244of246.bin", "group1-shard245of246.bin", "group1-shard246of246.bin"], "weights": [{"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/kernel", "shape": [25, 96], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/bias", "shape": [96], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/kernel", "shape": [25, 96], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/recurrent_kernel", "shape": [24, 96], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/bias", "shape": [96], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [176, 256], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [20, 32], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [20, 32], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [320, 128], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [128], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [28, 25], "dtype": "float32"}, {"name": "Embeddings/sharded_0", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_1", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_2", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_3", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_4", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_5", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_6", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_7", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_8", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_9", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_10", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_11", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_12", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_13", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_14", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_15", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_16", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_17", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_18", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_19", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_20", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_21", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_22", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_23", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_24", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_25", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_26", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_27", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_28", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_29", "shape": [26667, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_0", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_1", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_2", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_3", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_4", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_5", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_6", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_7", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_8", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_9", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_10", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_11", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_12", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_13", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_14", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_15", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_16", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_17", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_18", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_19", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_20", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_21", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_22", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_23", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_24", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_25", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_26", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_27", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_28", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_29", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_0", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_1", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_2", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_3", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_4", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_5", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_6", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_7", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_8", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_9", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_10", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_11", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_12", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_13", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_14", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_15", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_16", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_17", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_18", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_19", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_20", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_21", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_22", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_23", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_24", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_25", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_26", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_27", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_28", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_29", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_0", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_1", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_2", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_3", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_4", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_5", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_6", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_7", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_8", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_9", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_10", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_11", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_12", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_13", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_14", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_15", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_16", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_17", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_18", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_19", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_20", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_21", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_22", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_23", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_24", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_25", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_26", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_27", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_28", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_29", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_0", "shape": [18, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_1", "shape": [18, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_2", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_3", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_4", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_5", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_6", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_7", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_8", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_9", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_10", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_11", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_12", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_13", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_14", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_15", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_16", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_17", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_18", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_19", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_20", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_21", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_22", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_23", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_24", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_25", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_26", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_27", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_28", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_29", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_0", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_1", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_2", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_3", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_4", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_5", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_6", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_7", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_8", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_9", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_10", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_11", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_12", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_13", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_14", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_15", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_16", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_17", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_18", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_19", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_20", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_21", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_22", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_23", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_24", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_25", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_26", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_27", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_28", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_29", "shape": [10, 512], "dtype": "float32"}, {"name": "output_layer/kernel", "shape": [128, 5], "dtype": "float32"}, {"name": "output_layer/bias", "shape": [5], "dtype": "float32"}]}]}